from difflib import SequenceMatcher


def similar(a, b):
    return SequenceMatcher(None, a, b).ratio()


a = """
این سامانه به منظور انتقال وجه مبتنی بر حساب با مبالغ کلان در شبکه بانکی کشور ایجاد شده است. ساتنا جایگزینی برای چک های رمزدار بین بانکی است. چرخه زمانی عملیات ساتنا از طریق درگاه های غیر حضوری (موبایل بانک و اینترنت بانک) شنبه لغايت چهارشنبه (روزهاي کاری) از ساعت 7:30 تا 14:15 و در روزهای پنجشنبه از ساعت 7:30 تا 12:15 است و از طریق شعب تنها در ساعات اداری انجام می‌شود. سقف انتقال وجه ساتنا از طریق درگاه‌های غیر حضوری حداقل 500 میلیون ریال و حداکثر 1 میلیارد ریال است. حداقل مبلغ قابل انتقال ساتنا از طریق شعبه 500 میلیون ریال و ارائه اسناد مثبته دال بر انجام معامله برای انجام تراکنش های بالای 2 میلیارد ریال اشخاص حقیقی و بالای 10 میلیارد ریال اشخاص حقوقی الزامی است. کارمزد ساتنا دو صدم درصد وجه انتقالی تا سقف 25 هزار تومان است. 

"""
b = """
سلام دوست خاطر نباشتی؟ امدون بفرمه امدون بفرمه شرمدین میخواستم رنز پویو فاور کنند از ازا توید فاورش کنید بله؟ تو فاور کنید آ اونجا آخون اونجا فاور کردم رنز پویو رنز پویو اونجا منو درده آ اونجا فاور میشه باشه درست نلکشه آشم خدایی
"""

c = """
سلام بفرماییم سلام داده خطی نوشد به فرماییم به فرماییم بفرماییم داده شرمادهیم میخواستن رنگ گی پویا فعال کنم تا توی فعالش کنی؟ بله تو فعال کنیم اینجا فعال کردم رنگ پویا رنگ پویا باشه اونجا آهان اونجا فعال میکنه باشه سلام خوب وقعیشم خداکید
"""

d = """
سلام بخواهیم سلام داده خواهیم نباشه ممنون بفهمه شرمده میخواستم رمز پویا فعال کنم باید باید فعالش کنیم بله؟ باید فعال کنیم آه اونجا آه اونجا فعال کردم رمز پویا رمز پویا اونجا اونجا منو دارده آه اونجا فعال میشه باشه بسه لکن باشه مخدایی
"""

print(100 * similar(a, b))
print(100 * similar(a, c))
print(100 * similar(a, d))
